app/controllers/courses_controller.rb

SELECT "spots".* FROM "spots" WHERE "spots"."course_id" = ? AND "spots"."name" = ?  [["course_id", 1], ["name", "Muno"]]
---
  def search
    @course = Course.find(params[:id]).spot.where(name: params[:text])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def count
    @course = Course.where(id: params[:id])

INSERT INTO "courses" ("name", "spot_count", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kosen"], ["spot_count", 2], ["created_at", "2018-10-19 16:24:47.943393"], ["updated_at", "2018-10-19 16:24:47.943393"]]
---
  def create
    @course = Course.new(course_params)
  #  raise

    if @course.save