app/controllers/finishes_controller.rb

    def index
      @finishes = Finish.all
---
SELECT "finishes".* FROM "finishes"

    def show
      user = params[:user_id]
      user.to_i
      course = params[:course_id]
      course.to_i
      spot = params[:spot_id]
      spot.to_i
      @finish = Finish.where "user_id == ? and course_id == ? and spot_id == ?",user,course,spot
---
SELECT "finishes".* FROM "finishes" WHERE (user_id == '4' and cource_id == '3' and spot_id == '1')

    def create
      @finish = Finish.new(finish_params)

      if @finish.save
---
INSERT INTO "finishes" ("user_id", "spot_id", "created_at", "updated_at", "course_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["spot_id", 1], ["created_at", "2018-10-23 08:55:10.321644"], ["updated_at", "2018-10-23 08:55:10.321644"], ["course_id", 1]]