app/controllers/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
    @spots = Spot.all

SELECT "spots".* FROM "spots" WHERE (course_id == '1' and name == 'kanji')
---
  def show
    #@spot=Spot.find(params[:id])
    @spot = Spot.where "course_id == ? and name == ?",params[:id],params[:name]

INSERT INTO "spots" ("cource_id", "name", "GPS_X", "GPS_Y", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cource_id", 2], ["name", "i"], ["GPS_X", 14.21141221422567], ["GPS_Y", 10.98111123409807], ["created_at", "2018-10-14 05:14:33.090098"], ["updated_at", "2018-10-14 05:14:33.090098"]]
---
  def create
    @spot = Spot.new(spot_params)

    if @spot.save

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "spots" SET "data" = ?, "updated_at" = ? WHERE "spots"."id" = ?  [["data", "<11 bytes of binary data>"], ["updated_at", "2018-10-22 03:44:30.084560"], ["id", 1]]
---
  def imageup
    spot = Spot.find(params[:id])
    spot.data = request.raw_post
    spot.save!