app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "muno"], ["pass", "kanji"], ["created_at", "2018-10-12 12:16:18.485449"], ["updated_at", "2018-10-12 12:16:18.485449"]]